Revit 2027 API
DividedSurface.USpacingRule Property
Access to the rule for laying out the first series of equidistant parallel lines on the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpacingRule USpacingRule { get; }
Public ReadOnly Property USpacingRule As SpacingRule
	Get
public:
property SpacingRule^ USpacingRule {
	SpacingRule^ get ();
}
member USpacingRule : SpacingRule with get
Property Value
SpacingRule
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace